snlkuharlocal/src/Documents/ЗаявкаНаТСД/ЗаявкаНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТСД</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьТорг12</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТорг12</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникЦО</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>флКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СИсправлениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СФ_Без_ШК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьРеестрДеклараций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРНК</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудозатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заявка</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.КорректировочныйСчетФактура</types>
        <types>DocumentRef.РекламационнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерМетро</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьВРНК</name>
      <type>
        <types>EnumRef.УчитыватьВРНК</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/УчитыватьВычеркиВТорг12/УчитыватьВычеркиВТорг12.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчитыватьВычеркиВТорг12</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУстановкиРеквизита</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.КорректировкаЦенВНакладной</types>
      <types>DocumentRef.КорректировочныйСчетФактура</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыРНКПНКПРМ/РеквизитыРНКПНКПРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыРНКПНКПРМ</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/УчитыватьВРНК/УчитыватьВРНК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчитыватьВРНК</name>
  <enumValues>
    <name>УчитыватьВТорг12</name>
  </enumValues>
  <enumValues>
    <name>КСФ</name>
  </enumValues>
  <enumValues>
    <name>Торг12СИсправлением</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостояниеДокументов/СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеДокументов</name>
  <enumValues>
    <name>НеВыписаны</name>
  </enumValues>
  <enumValues>
    <name>Выписаны</name>
  </enumValues>
  <enumValues>
    <name>ВыписаныПовторно</name>
  </enumValues>
  <enumValues>
    <name>Получены</name>
  </enumValues>
  <enumValues>
    <name>ПолученыСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСумма</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденаСуммаСИзменениями</name>
  </enumValues>
  <enumValues>
    <name>ОшибкиОформления</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзображение</name>
  </enumValues>
  <enumValues>
    <name>СканСОшибками</name>
  </enumValues>
  <enumValues>
    <name>Проверены</name>
  </enumValues>
  <enumValues>
    <name>ГотовыКОтправкеВОФис</name>
    <comment>готов к отправке в офис из удаленного подразделения</comment>
  </enumValues>
  <enumValues>
    <name>ПолученДокументЗаместитель</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
    <comment>Документ с изменениями, сданный на склад для создания рекламации</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленВОфис</name>
    <comment>Оригинал отправлен в офис по письменному запросу</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращенВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВПРО</name>
  </enumValues>
  <enumValues>
    <name>ВнесеныИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПолученыВФилиале</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуютВосстановитьНеВозможно</name>
  </enumValues>
  <enumValues>
    <name>ПоДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ПодписанВЭДО</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыПретензииПокупателя/СтатусыПретензииПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПретензииПокупателя</name>
  <enumValues>
    <name>ОформлениеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотренииПРО</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотренииРуководителяПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеРКМ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументов</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаТСД/ObjectModule.bsl
//нечаева 22,11,16+++
Функция ПолучитьДанныеРегистраУчитыватьВычерки(Док) Экспорт
	
	УчитыватьВРНк = Перечисления.УчитыватьВРНК.ПустаяСсылка();
	
	запрос  = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчитыватьВычеркиВТорг12.Значение
	|ИЗ
	|	РегистрСведений.УчитыватьВычеркиВТорг12 КАК УчитыватьВычеркиВТорг12
	|ГДЕ
	|	УчитыватьВычеркиВТорг12.Документ.ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ",Док.ссылка);
	Рез = Запрос.Выполнить().выбрать();
	Если Рез.Следующий() Тогда
		УчитыватьВРНК = Рез.Значение;
	КонецЕсли;
	
	возврат учитыватьВРНК;
	
КонецФункции
//нечаева 22,11,16---



Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		УзелПолучатель = ПланыОбмена.Основной.НайтиПоКоду("SNL");
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	// это в ЦО должно происходить?
	
	Если НЕ ОбменДанными.Загрузка Тогда
				
		#если клиент Тогда
			
			// только если в документе поменяли значение. тогда только Кудряшов может.
			// Для все строк проверим изменение
			НетИзмененийСтатусовВычерков = истина;
			
			Для каждого ТекСтрока из  заявка цикл
				
				Если ТекСтрока.Накладная.метаданные().Имя = "РасходнаяНакладная" или текстрока.УчитыватьВРНК.Пустая() Тогда
					продолжить;
				КонецЕсли;
				
				ТекЗначениеУчета = ПолучитьДанныеРегистраУчитыватьВычерки(ТекСтрока.Накладная);
				// сравним из регистра, и из строки
				Если  ТекЗначениеУчета <> перечисления.УчитыватьВРНК.ПустаяСсылка() Тогда
					
					Если ТекСтрока.УчитыватьВРНК <> ТекЗначениеУчета тогда
						// если значения поменялись
						НетИзмененийСтатусовВычерков = Ложь;
						
					КонецЕсли;
				иначе
					//если пустые значения есть, то пишем изменения.
					НетИзмененийСтатусовВычерков = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
			
			Если Не НетИзмененийСтатусовВычерков Тогда
				
				ПрописатьЗначенияВычерковВРегистр();
				
			КонецЕсли;
			
		#КонецЕсли
		//нечаева 16,12,16--
		Для Каждого СтрокаНакладной Из Заявка Цикл
			
			Если СтрокаНакладной.Накладная.Метаданные().Имя = "РасходнаяНакладная" Тогда
				продолжить;
			КонецЕсли;	
			
			// получаем статус РКМ и КЦН
			ЗнРеквизита = ПолучитьДанныеРегистраУчитыватьВычерки(СтрокаНакладной.Накладная);
			
			Если ЗнРеквизита = перечисления.УчитыватьВРНК.УчитыватьВТорг12 Тогда
				
				Накладная=СтрокаНакладной.Накладная.ДокОснование; // для РНК ставим этот статус
				Если Накладная<>Неопределено И ЕстьРеквизитДокумента("СостояниеДокументов",Накладная.Метаданные()) Тогда
					НакладнаяОбъект = Накладная.ПолучитьОбъект();
					НакладнаяОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ВнесеныИзменения,Неопределено,Истина);
				КонецЕсли;
				
			КонецЕсли;
			
			
		КонецЦикла;

		
		
	КонецЕсли;	
	// 25,11,16--- 
	
	
	
КонецПроцедуры

//нечаева 15,12,16 +++
Процедура ПрописатьЗначенияВычерковВРегистр() Экспорт
	
	// проставляем доп. реквизиты в РКм и КЦН.
	ТекущаяДатаЗапрета=КонецДня(Константы.ДатаЗапретаРедактирования.Получить());
	
	Для каждого ТекСтрока из  заявка цикл
		
		Если ТекСтрока.Накладная.метаданные().Имя = "РасходнаяНакладная" или текстрока.УчитыватьВРНК.Пустая() Тогда
			продолжить;
		КонецЕсли;
		
		// проверим, что документы в открытом периоде.
		ДатаДок = ТекСтрока.Накладная.Дата;
		ПустоеЗначениеУчета = ПолучитьДанныеРегистраУчитыватьВычерки(ТекСтрока.Накладная);
		// пока не было записи у документа в регистр учитывать в рнк.
		Если  (ДатаДок>ТекущаяДатаЗапрета и ПустоеЗначениеУчета = перечисления.УчитыватьВРНК.ПустаяСсылка()) 
			//1. для сотрудников ПРО разрешаем менять значение в ркм и кнц в открытом периоде.
			//2. в закрытом только у сотрудников бухгалтерии это право
			ИЛИ (ДатаДок>ТекущаяДатаЗапрета и ПолучитьПолномочиеПользователя("РедактированиеВидаПечатиДокУКонтрагента"))
			или (ПолучитьПолномочиеПользователя("РедактированиеВычерковБухгалтериейВЗакрытомПериоде"))
			Тогда
			
			// нечаева 22,11,16+++
			// переделываем на регистр.
			НаборЗаписей = РегистрыСведений.УчитыватьВычеркиВТорг12.СоздатьНаборЗаписей(); 
			
			НаборЗаписей.Отбор.Документ.Установить(ТекСтрока.Накладная); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Значение = Текстрока.УчитыватьВРНК; 
			НоваяЗапись.Документ = ТекСтрока.Накладная; 
			НоваяЗапись.ДатаУстановкиРеквизита = текущаяДата();
			
			НаборЗаписей.Записать(); 
			
			// нечаева 22,11,16---
			
			// помечаем на удаление КСФ, если статус "Учитывать в Торг-12".
			Если ТекСтрока.УчитыватьВРНК = перечисления.УчитыватьВРНК.УчитыватьВТорг12  Тогда
				// помечаем на удаление					
				КСФ=Неопределено;
											
				// по указанию от Коноваловой, больше не помечаем на удаление
				// Нечаева 25,12,24 +++
				//КСФ=КСчетФактураНакладной(ТекСтрока.Ссылка,);
				//Если НЕ КСФ.Пустая() Тогда
				//	// снимаем проведение
				//	КСФ_Объект=КСФ.ссылка.получитьОбъект();
				//	КСФ_Объект.пометкаУдаления = истина;
				//	КСФ_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения,РежимПроведенияДокумента.Неоперативный);
				//КонецЕсли;
				// Нечаева 25,12,24 ---

			иначе
				// проводим
				КСФ=Неопределено;
				
				КСФ=КСчетФактураНакладной(ТекСтрока.Накладная.Ссылка,);
				//крохин начало 10.06.2019
				//проводим только непроведенные
				//Если НЕ КСФ.Пустая() Тогда
				Если НЕ КСФ.пустая() И НЕ КСФ.Проведен Тогда
				//крохин конец 10.06.2019	
					// снимаем проведение
					КСФ_Объект=КСФ.ссылка.получитьОбъект();
					КСФ_Объект.пометкаУдаления = ложь;
					КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				КонецЕсли;	
			КонецЕсли;
			
			
		иначе
			//сообщить("Статус документа вычерка не записан, закрытый период. Обратитесь в отдел ПРО."+ТекСтрока.Накладная);  
			//Отказ = истина;
			// на период тестов оставим сообщение
		КонецЕсли;
		
		//для сотрудников ПРО разрешаем менять в открытом периоде данные, по РКМ и КЦН, в заявке на ТСД.
		// в закрытом только у сотрудников бухгалтерии это право
		//или ПолучитьПолномочиеПользователя("РедактированиеВидаПечатиДокУКонтрагента") Тогда
		
		
	КонецЦикла;
	
КонецПроцедуры
// нечаева 15,12,16---

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ВсеИсполнено = Истина;
	колЗ = Заявка.Количество();
	Если колЗ <> 0 Тогда
		кол = 0;
		Для каждого стр из Заявка  Цикл
			Если не стр.Выполнено Тогда
				ВсеИсполнено = Ложь;
				кол = кол+1;
			КонецЕсли;
		КонецЦикла;
		Если Не ВсеИсполнено Тогда
			Если кол <> колЗ тогда
				СостояниеДокумента = "Выполнена частично";
			КонецЕсли;
		Иначе
			СостояниеДокумента = "Выполнена";
		КонецЕсли;
	КонецЕсли;
	//Кухарь 25.04.18 Начало
	//Будем фиксировать сколько заняла печать каждой накладной
	Трудозатраты=Заявка.Итог("Трудозатраты");
	//Кухарь 25.04.18 Конец
	
	//крохин начало 14.06.2020
	//требуется изменение статуса претензии
	Если Не ОбменДанными.Загрузка И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Для Каждого СтрокаЗаявки Из Заявка Цикл
			Если СтрокаЗаявки.Накладная.Метаданные().Имя = "РекламационнаяНакладная" Тогда
				ПретензияПолучателя = СтрокаЗаявки.Накладная.ПретензияПолучателя;
				Если НЕ ПретензияПолучателя.Пустая() И ПретензияПолучателя.Проведен  И ПретензияПолучателя.СтатусПретензии <> Перечисления.СтатусыПретензииПокупателя.Завершена Тогда
					КоличествоПретензияПолучателя = 0;
					ВсегоПретензияПолучателя = 0;
					ДокПретензияПолучателя = ПретензияПолучателя.ПолучитьОбъект();
					Для Каждого СтрокаТЧ Из ПретензияПолучателя.Товары Цикл
						Если СтрокаТЧ.Решение = Перечисления.СостоянияКоррекции.Принята Тогда
							КоличествоПретензияПолучателя = КоличествоПретензияПолучателя + СтрокаТЧ.Количество;
							ВсегоПретензияПолучателя = ВсегоПретензияПолучателя + СтрокаТЧ.Всего;
						КонецЕсли;
					КонецЦикла;
					Если СтрокаЗаявки.Накладная.КоличествоДокумента = КоличествоПретензияПолучателя И СтрокаЗаявки.Накладная.СуммаДокумента = ВсегоПретензияПолучателя Тогда
						ДокПретензияПолучателя.СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.Завершена;
						ДокПретензияПолучателя.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//крохин конец 14.06.2020
	
	
КонецПроцедуры

//Катаев+ 14/04/14
Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого стр из Заявка Цикл
		стр.Выполнено = Ложь;
		стр.ДатаИсполнения = Дата(1,1,1);
		стр.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
		//нечаева 20,12,16 +++
		Если Стр.Накладная.Метаданные().имя = "КЦН" или Стр.Накладная.Метаданные().имя = "РКМ" Тогда
			стр.УчитыватьВРНК = ПолучитьДанныеРегистраУчитыватьВычерки(Стр.Накладная);
			Если стр.УчитыватьВРНК = перечисления.УчитыватьВРНК.ПустаяСсылка() Тогда
				стр.УчитыватьВРНК = Перечисления.УчитыватьВРНК.КСФ;
			КонецЕсли;
		КонецЕсли;
		//нечаева 20,12,16 --
		
	КонецЦикла;
КонецПроцедуры //Катаев- 14/04/14


Функция ПолучитьНомерМетро(Накладная)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("ИмяРеквизита", "НомерПриемкиМетро");
	//крохин начало 25.07.2017
	//для РКМ и КЦН номер приемки из РНК
	//Запрос.УстановитьПараметр("Документ", Накладная);
	Если Накладная.Метаданные().Имя = "РасходнаяНакладная" Тогда
		Запрос.УстановитьПараметр("Документ", Накладная);
	Иначе
	    Запрос.УстановитьПараметр("Документ", Накладная.ДокОснование);	
	КонецЕсли;
	//крохин конец 25.07.2017
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции
//нечаева 22,11,16---


//Кухарь 08.10.19 начало
//Процедура ОбработкаЗаполнения(Основание)
Процедура ОбработкаЗаполнения(Основание) экспорт
//Кухарь 08.10.19 конец	

	
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	ТекРНК = Основание;
	//нечаева 23,11,16+++
	// проверим, что есть КЦН
	
	//крохин начало 05.06.2019
	//печать КСФ по возвратам пачкой
	Если Основание.Метаданные().Имя = "ПриходнаяНакладная" и Основание.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя И Основание.Рекламации.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КорректировочныйСчетФактураНакладные.Ссылка,
		               |	КорректировочныйСчетФактураНакладные.Накладная,
		               |	КорректировочныйСчетФактураНакладные.Ссылка.ДокументОснование
		               |ИЗ
		               |	Документ.КорректировочныйСчетФактура.Накладные КАК КорректировочныйСчетФактураНакладные
		               |ГДЕ
		               |	КорректировочныйСчетФактураНакладные.Ссылка.Проведен
		               |	И КорректировочныйСчетФактураНакладные.Накладная.Проведен
					   |    И КорректировочныйСчетФактураНакладные.Накладная.КоличествоДокумента > 0
		               |	И КорректировочныйСчетФактураНакладные.Накладная.ДокументВозврата = &ДокументВозврата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КорректировочныйСчетФактураНакладные.Накладная.Дата
		               |АВТОУПОРЯДОЧИВАНИЕ";
					   
Запрос.УстановитьПараметр("ДокументВозврата",Основание);

Выборка = Запрос.Выполнить().Выбрать();
Пока Выборка.Следующий() Цикл
	//крохин начало 10.06.2019
	//СтрРНК=заявка.Добавить();
	//СтрРНК.Накладная=Выборка.ДокументОснование;
	//стрРНК.ВидОтправки = "ЗаказноеПР";
	//стрРНК.НомерМетро = ПолучитьНомерМетро(ТекРНК);
	//
	//стрРНК.УчитыватьВРНк = перечисления.УчитыватьВРНК.КСФ;
    //крохин конец 10.06.2019

СтрРНК=заявка.Добавить();
	СтрРНК.Накладная=Выборка.Накладная;
	стрРНК.ВидОтправки = "ЗаказноеПР";
	стрРНК.НомерМетро = ПолучитьНомерМетро(ТекРНК);
	
	стрРНК.УчитыватьВРНк = перечисления.УчитыватьВРНК.КСФ;
КонецЦикла;
    Примечание = "Возврат по "+Основание;
	ЭтотОбъект.Основание = "Исправления(КЦН/РКМ)";
	//крохин начало 11.06.2019
	//не нужно
	//ПечататьСФ = Истина;
	//КоличествоСФ = 1;
	//крохин конец 11.06.2019
	КоррСФ = Истина;
	Иначе
	//крохин конец 05.06.2019
	
	КСФ=Неопределено;
	организация = справочники.Организации.НайтиПоКоду("");
	КСФ=КСчетФактураНакладной(Основание.Ссылка,Организация);
	Если КСФ = неопределено или ксф = документы.КорректировочныйСчетФактура.ПустаяСсылка()  тогда
		сообщить("К документу нет КЦН или РКМ");
		возврат;
	конецЕсли;
	

	//Кухарь 06.06.19 начало 
    //Совпадение? Не думаю.. 
    //Основание = "Исправления(КЦН/РКМ)"; 
    ЭтотОбъект.Основание = "Исправления(КЦН/РКМ)"; 
        //Кухарь 06.06.19 конец  

	ФорматОтправки = "PDF";
	//добавим РНК и ее подчиненные документы
	
	СтрРНК=заявка.Добавить();
	СтрРНК.Накладная=ТекРНК;
	стрРНК.ВидОтправки = "ЗаказноеПР";
	стрРНК.НомерМетро = ПолучитьНомерМетро(ТекРНК);
	
	
	// Нечаева 27,09,16++++
	// если есть ркм и кнц добавляем их в заявку на тсд.
	
	ТипКонтрагента = ТекРНК.контрагент.ВидПечатиЗаявкиНаТСД;
	
	Если ТипКонтрагента = 0 или ТипКонтрагента = неопределено Тогда
		ЗнПоУм = перечисления.УчитыватьВРНК.КСФ;
	Иначе
		ЗнПоУм = перечисления.УчитыватьВРНК.УчитыватьВТорг12;
	КонецЕсли;
	
	
	
	Запрос = новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	|	КорректировкаЦенВНакладной.Ссылка
	|ИЗ
	|	Документ.КорректировкаЦенВНакладной КАК КорректировкаЦенВНакладной
	|ГДЕ
	|	КорректировкаЦенВНакладной.ДокОснование = &рнк
	|	И КорректировкаЦенВНакладной.Проведен = истина
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РекламационнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
	|ГДЕ
	|	РекламационнаяНакладная.ДокОснование = &рнк
	|	И РекламационнаяНакладная.Проведен = истина";
	запрос.УстановитьПараметр("рнк",ТекРНк.ссылка);			   
	Рез = запрос.Выполнить().Выбрать();
	
	пока рез.Следующий() цикл
		СтрРкм=заявка.Добавить();
		СтрРкм.Накладная=рез.ссылка;
		стрРкм.ВидОтправки = "ЗаказноеПР";
		
		СтрРкм.УчитыватьВРНк=ЗнПоУм;
			
		//нечаева 22,11,16+++
		ЗначениеДокументаУчитыватьВРНК =  ПолучитьДанныеРегистраУчитыватьВычерки(СтрРкм.Накладная);
		//нечаева 22,11,16---				

		Если ЗначениеДокументаУчитыватьВРНК<>перечисления.УчитыватьВРНК.ПустаяСсылка() ТОгда
			// и НЕ ПолучитьПолномочиеПользователя("РедактированиеВидаПечатиДокУКонтрагента")  не зависимо от про или нет. иначе они могут пропустить.
			// менять руками в таб части.
			СтрРкм.УчитыватьВРНк=ЗначениеДокументаУчитыватьВРНК;
		КонецЕсли;
		
	конецЦикла;
	
	Если не УчитыватьВРНК.Пустая() Тогда
		//СтрРНК.УчитыватьВРНк=УчитыватьВРнк;
		// тут не прописываем, для РНК это не нужно
	КонецЕсли;
	// Нечаева 19,09,16----
	
	
	//нечаева 23,11,16---
	
	//крохин начало 05.06.2019
	КонецЕсли;
	//крохин конец 05.06.2019
КонецПроцедуры
